Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: This is done to improve the reliability of scripts because a window sometimes can't keep up with a rapid flood of keystrokes.
ja: これはスクリプトの信頼性を高めるためで、キー入力が殺到するとウィンドウが追いつかなくなることがあるためです。

source: This is done to improve the reliability of scripts because a window sometimes can't keep up with a rapid flood of mouse events.
ja: これはスクリプトの信頼性を高めるためで、マウスイベントの急増にウィンドウがついていけないことがあるからです。

source: This is done to improve the reliability of scripts because a window sometimes needs a period of "rest" after being created, activated, minimized, etc. so that it has a chance to update itself and respond to the next function that the script may attempt to send to it.
ja: これは、スクリプトの信頼性を向上させるためである。というのも、ウィンドウは、作成、アクティブ化、最小化などの後、それ自身を更新し、スクリプトがウィンドウに送信しようとする次の関数に応答する機会を得るために、一定期間の「休息」を必要とすることがあるからである。

source: This is done to prevent any owned windows (such as GUI windows or certain dialog windows) from automatically being minimized, but also has the effect of hiding the main window's taskbar button.
ja: これは、所有するウィンドウ（GUIウィンドウや特定のダイアログウィンドウなど）が自動的に最小化されるのを防ぐために行われますが、メインウィンドウのタスクバーボタンを隠す効果もあります。

source: This is done via automatic backspacing, which can be disabled via the b0 option.
ja: これは自動バックスペースによって行われますが、b0オプションによって無効にすることができます。

source: This is due to a security mechanism called User Interface Privilege Isolation.
ja: これは、User Interface Privilege Isolationと呼ばれるセキュリティの仕組みによるものです。

source: This is either 4 (32-bit) or 8 (64-bit), depending on what type of executable (EXE) is running the script.
ja: これは、スクリプトを実行する実行可能ファイル（EXE）のタイプに応じて、4（32ビット）または8（64ビット）のいずれかになります。

source: This is equivalent to [a-zA-Z0-9_].
ja: これは[a-zA-Z0-9_]と等価である。

source: This is equivalent to assigning Size.
ja: これは、サイズを割り当てることと同じです。

source: This is equivalent to choosing "Exit" from the script's tray menu or main menu.
ja: これは、スクリプトのトレイメニューやメインメニューから「終了」を選択することと同じです。

source: This is equivalent to dividing Value1 by "2 to the Value2th power" and rounding the result to the nearest integer leftward on the number line; for example, -3>>1 is -2.
ja: これは、Value1を「2のValue2乗」で除算し、その結果を数直線上で左方向に最も近い整数に四捨五入することと同じである。例えば、-3>>1は-2である。

source: This is equivalent to multiplying Value1 by "2 to the Value2th power".
ja: これは、Value1に「2のValue2乗」を掛けることと同じである。

source: This is equivalent to setting each item with MapObj[Key] := Value, except that __Item is not called and Capacity is automatically adjusted to avoid expanding multiple times during a single call.
ja: これは、MapObj[Key] := Valueで各項目を設定することと同じですが、__Itemが呼ばれないことと、1回の呼び出しで複数回展開しないように容量が自動的に調整されることが異なります。

source: This is equivalent to the SM_CXEDGE value for windows with the 3-D look.
ja: これは、3-DルックのウィンドウのSM_CXEDGEの値に相当する。

source: This is equivalent to the bracket syntax.
ja: これはブラケット構文と同じである。

source: This is equivalent:
ja: これは等価だ：

source: This is especially true for 16x16 icons.
ja: これは特に16x16アイコンの場合に当てはまります。

source: This is especially useful for changing the properties of the window before showing it.
ja: これは、ウィンドウを表示する前にウィンドウのプロパティを変更する場合に特に有効です。

source: This is functionally identical to WinSetTransColor "Off", WinTitle.
ja: これはWinSetTransColor "Off"、WinTitleと機能的に同じです。

source: This is functionally identical to WinSetTransColor "Off".
ja: これはWinSetTransColor "Off"と機能的に同じです。

source: This is functionally identical to WinSetTransparent "Off", WinTitle.
ja: これはWinSetTransparent "Off"、WinTitleと機能的に同じである。

source: This is functionally identical to WinSetTransparent "Off".
ja: これはWinSetTransparent "Off"と機能的に同じです。

source: This is generally not a problem unless multiple classes refer to each other.
ja: これは、複数のクラスが互いに参照し合わない限り、一般的には問題にはなりません。

source: This is generally used with COM functions and is valid only as a return type without any prefix or suffix.
ja: これは一般にCOM関数で使用され、接頭辞や接尾辞のない戻り値型としてのみ有効です。

source: This is helpful to prevent accidental double-presses.
ja: 誤って二度押ししてしまうのを防ぐのに有効です。

source: This is how a lot of "pros" have learned.
ja: こうして多くの「プロ」が学んできた。

source: This is identical in function to Gui.Hide except that it allows a hidden window to be moved or resized without showing it.
ja: この機能はGui.Hideと同じですが、非表示のウィンドウを表示せずに移動したりサイズを変更したりすることができます。

source: This is intended for use with DllCall and ComCall, so the pointer does not need to be manually wrapped after the function returns.
ja: これはDllCallやComCallでの使用を想定しており、関数が戻った後にポインタを手動でラップする必要がありません。

source: This is intended to prevent errors caused by forgetting to declare a global variable inside a function before attempting to assign to it.
ja: これは、グローバル変数を関数内で宣言してから代入しようとした場合に起こるエラーを防止するためのものです。

source: This is known as inheritance by delegation or differential inheritance, because an object can implement only the parts that make it different, while delegating the rest to its base.
ja: これは、委譲による継承または差分継承と呼ばれるもので、オブジェクトは、そのオブジェクトを異なるものにする部分のみを実装し、残りをベースに委譲することができるからである。

source: This is known as a continuation section.
ja: これは継続区間として知られている。

source: This is known as an escape sequence.
ja: これをエスケープシーケンスと呼びます。

source: This is like HotIf "Expression", except that each hotkey can have many variants (one per object).
ja: これはHotIf「式」のようなもので、各ホットキーが多くのバリエーション（オブジェクトごとに1つ）を持つことができることを除けば、「表現」です。

source: This is mandatory if any other parameters are used, unless /gui is used.
ja: これは、/guiが使用されていない限り、他のパラメータが使用されている場合は必須である。

source: This is most commonly used to group together multiple assignments or function calls.
ja: これは、複数の割り当てや関数コールをグループ化するためによく使われる。

source: This is most commonly used with the Modify method to alter individual fields in a row without affecting those that lie to their left.
ja: これは、Modifyメソッドで最もよく使われる方法で、左側にあるフィールドに影響を与えずに、行内の個々のフィールドを変更することができます。

source: This is most often used for "else if" ladders (see examples at the bottom).
ja: これは、「else if」ラダーに最もよく使われます（下部の例を参照）。

source: This is most useful when defining a large number of hotstrings which call functions, as it would otherwise require three lines per hotstring.
ja: これは、関数を呼び出す多数のホットストリングを定義する場合に最も便利で、そうでなければホットストリングごとに3行必要だからです。

source: This is necessary only in a hotstring's triggering abbreviation.
ja: これは、ホットストリングのトリガー省略形でのみ必要である。

source: This is necessary only when Component would otherwise be ambiguous, such as when multiple components exist with the same name, or the display name is empty, an integer or contains a colon.
ja: これは、同じ名前のコンポーネントが複数存在する場合や、表示名が空、整数、コロンを含む場合など、Componentがそうでなければ曖昧になる場合にのみ必要である。

source: This is necessary only when Device would otherwise be ambiguous, such as when multiple devices exist with the same name, or the display name contains a colon.
ja: これは、同じ名前のデバイスが複数存在する場合や、表示名にコロンが含まれる場合など、Deviceが曖昧になる場合にのみ必要です。

source: This is not a limit:
ja: これは制限ではありません：

source: This is not a limit: rows beyond the count can still be added.
ja: これは制限ではありません：を超える行を追加することができます。

source: This is not common.
ja: これは一般的ではありません。

source: This is not normally needed, but may be used with DllCall or SendMessage or to optimize repeated concatenation.
ja: 通常は必要ありませんが、DllCallや SendMessageと併用したり、繰り返しの連結を最適化するために使用されることがあります。

source: This is not recommended, and is not feasible on Windows 8 or later.
ja: これは推奨されておらず、Windows 8以降では実現不可能です。

source: This is not the same as omitting a parameter, although it may have the same effect in some cases.
ja: これは、場合によっては同じ効果をもたらすかもしれませんが、パラメータを省略することとは異なります。

source: This is often referred to as a quoted literal string, or just quoted string.
ja: これはしばしば引用リテラル文字列、あるいは単に引用文字列と呼ばれる。

source: This is often used in conjunction with remapping keys or buttons.
ja: キーやボタンのリマッピングとセットで使われることが多いです。

source: This is often used in conjunction with the GUI's +LastFound option.
ja: これはGUIの+LastFoundオプションと併用されることが多い。

source: This is often used on a window that owns other windows (see Owner).
ja: 他のウィンドウを所有するウィンドウでよく使われます（「所有者」参照）。

source: This is often used to organise code into separate files, or to make use of script libraries written by other users.
ja: これは、コードを別のファイルに整理したり、他のユーザーが書いたスクリプトライブラリを利用するためによく使われます。

source: This is one of the following:
ja: これは、以下のいずれかとなります：

source: This is one of the following: ActiveX, Button, CheckBox, ComboBox, Custom, DateTime, DropDownList (or DDL), Edit, GroupBox, Hotkey, Link, ListBox, ListView, MonthCal, Picture (or Pic), Progress, Radio, Slider, StatusBar, Tab, Tab2, Tab3, Text, TreeView, UpDown
ja: これは、以下のいずれかとなります：ActiveX、Button、CheckBox、ComboBox、Custom、DateTime、DropDownList（またはDDL）、Edit、GroupBox、Hotkey、Link、ListBox、ListView、MonthCal、Picture（またはPic）、Progress、Radio、Slider、StatusBar、Tab、Tab2、Tab3、Text、TreeView、UpDown

source: This is only valid, and is required, when remapping a key to {.
ja: これは、キーを{にリマップする場合にのみ有効であり、必須である。

source: This is optional when Buffer is an object; otherwise, it is required.
ja: Bufferがオブジェクトの場合はオプション、それ以外の場合は必須とします。

source: This is optional when Data is an object or string; otherwise, it is required.
ja: Dataがオブジェクトまたは文字列の場合はオプション、それ以外の場合は必須とします。

source: This is optional when Data is an object.
ja: Dataがオブジェクトの場合は省略可能です。

source: This is part of the language syntax, so is not dependent on the object.
ja: これは言語構文の一部であり、オブジェクトに依存するものではない。

source: This is partly to encourage best practices, and partly to avoid inconsistency between dynamic and non-dynamic variable references in functions.
ja: これは、ベストプラクティスを奨励するためでもあり、関数内の動的変数参照と非動的変数参照との間の矛盾を避けるためでもあります。

source: This is perfectly fine since the if-statement only had one line of code associated with it.
ja: ifステートメントに関連するコードは1行だけなので、これはまったく問題ない。

source: This is present only in the two-parameter mode.
ja: 2パラメータモード時のみ存在します。

source: This is primarily due to implementation complexity.
ja: これは主に、実装の複雑さによるものです。

source: This is primarily for consistency:
ja: これは主に一貫性を保つためです：

source: This is primarily for consistency: in v1, and := 1 was allowed on its own line but (and := 1) would not work.
ja: これは主に一貫性を保つためです：v1では、and := 1は、単独で行えたが、(and := 1)は動作しません。

source: This is primarily useful when specifying ahk_ criteria in combination with variables.
ja: これは主に、変数と組み合わせてahk_基準を指定するときに便利です。

source: This is recommended, as the UI Access option requires the program to be installed under Program Files.
ja: UI Accessオプションでは、プログラムをProgram Filesの下にインストールする必要があるため、これをお勧めします。

source: This is referred to as the native encoding.
ja: これをネイティブエンコードと呼びます。

source: This is referred to as the One True Brace (OTB) style.
ja: これをOTB（One True Brace）スタイルと呼びます。

source: This is seldom an issue for system-generated messages because most of them are posted.
ja: システムで生成されたメッセージは、そのほとんどが投稿されるため、これが問題になることはほとんどありません。

source: This is similar to omitting & and explicitly dereferencing the parameter inside the function (e.g. %Third%), but in this case the percent signs are omitted.
ja: これは、&を省略して関数内で明示的にパラメータを再参照する方法（例、%Third%）と似ていますが、この場合はパーセント記号が省略されています。

source: This is sometimes also referred to as a "functor".
ja: これは「ファンクター」とも呼ばれる。

source: This is supported even within a nested try...finally, but not within a nested try...catch.
ja: これは、ネストしたtry...finally内でもサポートされていますが、ネストしたtry...catch内ではサポートされていません。

source: This is supported even within a nested Try-Finally, but not within a nested Try-Catch.
ja: これはネストされたTry-Finally内でもサポートされるが、ネストされたTry-Catch内ではサポートされない。

source: This is the default behavior.
ja: これはデフォルトの動作です。

source: This is the default behaviour if this directive is not used.
ja: このディレクティブが使用されていない場合のデフォルトの動作です。

source: This is the default mode if none of the other case sensitivity options are used.
ja: これは、他の大文字小文字の区別オプションが使われていない場合のデフォルト・モードです。

source: This is the default setting.
ja: これは初期設定です。

source: This is the default.
ja: これはデフォルトです。

source: This is the initial setting for all scripts:
ja: これは、すべてのスクリプトの初期設定です：

source: This is the key that invokes the right-click context menu.
ja: 右クリックのコンテキストメニューを呼び出すためのキーです。

source: This is the means by which a compiled script is created from an .exe file.
ja: これは、.exeファイルからコンパイルされたスクリプトを作成する手段である。

source: This is the most common.
ja: これが一番多いですね。

source: This is the number to which the script refers to display a particular icon in a row or column header.
ja: 行や列のヘッダーに特定のアイコンを表示する際に、スクリプトが参照する番号です。

source: This is the original number assigned when the column was created; that is, it does not reflect any dragging and dropping of columns done by the user.
ja: これは、カラムが作成されたときに割り当てられたオリジナルの番号です。つまり、ユーザーによるカラムのドラッグ＆ドロップは反映されません。

source: This is the same as the example above except that it's for the clipboard.
ja: これは、クリップボード用であることを除けば、上の例と同じです。

source: This is the same effect as WinClose "ahk_group GroupName".
ja: WinClose "ahk_group GroupName"と同じ効果です。

source: This is the simplest form for a variable.
ja: これは変数の最も単純な形である。

source: This is the starting default for all scripts.
ja: これは、すべてのスクリプトの開始時のデフォルトです。

source: This is the starting default used by all scripts.
ja: これは、すべてのスクリプトで使用される開始時のデフォルトです。

source: This is the state that the OS and the active window believe the key to be in, but is not necessarily the same as the physical state.
ja: OSやアクティブウィンドウがキーがあると信じている状態であり、必ずしも物理的な状態と同じではありません。

source: This is the window most recently found by WinExist, WinActive, WinWait[Not]Active, WinWait, or WinWaitClose.
ja: これは、WinExist、WinActive、WinWait[Not]Active、WinWait、またはWinWaitCloseによって最近見つかったウィンドウである。

source: This is to ensure that built-in methods can always identify the native type of an object, and operate only on objects that have the correct binary structure.
ja: これは、組み込みメソッドが常にオブジェクトのネイティブ・タイプを識別し、正しいバイナリ構造を持つオブジェクトに対してのみ操作できるようにするためである。

source: This is to support the following behaviour:
ja: これは、次のような行動をサポートするためです：

source: This is typically expressed as a hexadecimal number in Red-Green-Blue (RGB) format.
ja: これは通常、赤緑青（RGB）形式の16進数で表現されます。

source: This is typically expressed as a hexadecimal number in red-green-blue (RGB) format.
ja: これは通常、赤緑青（RGB）形式の16進数で表現されます。

source: This is typically omitted because the standard calling convention is much more common for callbacks.
ja: コールバックでは標準の呼び出し規約の方がはるかに一般的なので、これは通常省略されます。

source: This is typically used to create a hotkey in an initially-disabled state.
ja: これは、通常、初期状態では無効な状態のホットキーを作成するために使用されます。

source: This is typically used to provide a default value when it is known that a variable or optional parameter might not already have a value.
ja: これは通常、変数やオプショナル・パラメータにまだ値がないことが分かっている場合に、デフォルト値を提供するために使われる。

source: This is up to the program, and can usually be avoided by doubling the backslash, as in Run 'my.exe "A\\" B', which usually produces two parameters (A\ and B).
ja: これはプログラム次第で、通常、Run 'my.exe "A\\" B'のようにバックスラッシュを2重にすることで回避することが可能です。これは通常2つのパラメータ（A\、B）を生成します。

source: This is used by Send to determine whether to push the modifier keys back down after having temporarily released them.
ja: Sendが、修飾キーを一時的に離した後、押し戻すかどうかを判断するために使用されます。

source: This is used to access pseudo-arrays, described below.
ja: 後述する擬似配列にアクセスするために使用します。

source: This is used to pass the notepad_pid variable to the Run function by reference (in other words, to pass the variable itself instead of its value), allowing the function to assign a new value to the variable.
ja: Run関数にnotepad_pid変数を参照渡し（つまり、値ではなく変数そのものを渡す）、関数が変数に新しい値を代入できるようにするために使用されます。

source: This is useful for converting file names -- such as those passed into a script as command line parameters -- to their exact path names as shown by Explorer.
ja: コマンドラインパラメーターとしてスクリプトに渡されたファイル名などを、エクスプローラで表示される正確なパス名に変換するのに便利です。

source: This is useful for determining whether the user is away.
ja: これは、ユーザーが不在かどうかを判断するのに便利である。

source: This is useful if a window does not appear to have any controls at all, or just for the convenience of not having to worry about which control to send to.
ja: これは、ウィンドウにコントロールが全くないように見える場合、またはどのコントロールに送信するかを気にする必要がない便利な機能です。

source: This is useful in cases where the string has been altered indirectly, such as by passing its address via DllCall or SendMessage.
ja: これは、DllCallや SendMessageでアドレスを渡すなど、文字列が間接的に変更された場合に便利である。

source: This is useful in the rare case where a key has no name and produces no visible character when pressed.
ja: これは、キーに名前がなく、押しても何も表示されないような場合に便利です。

source: This is useful in the rare case where a key has no name.
ja: これは、キーに名前がないような稀なケースに有効です。

source: This is useful to change only the hotkey's Options.
ja: ホットキーのOptionsのみを変更したい場合に便利です。

source: This is useful to change only the hotstring's options, or to turn it on or off.
ja: ホットストリングのオプションだけを変更したり、オン/オフを切り替えたりするのに便利です。

source: This is useful to resize the window after new controls are added, or existing controls are resized, hidden, or unhidden.
ja: これは、新しいコントロールが追加されたり、既存のコントロールがサイズ変更されたり、隠されたり、隠されなかったりした後に、ウィンドウのサイズを変更するのに便利です。

source: This is useful when a particular pattern (especially a complex one) will be executed many times.
ja: これは、特定のパターン（特に複雑なパターン）が何度も実行される場合に便利である。

source: This is useful when a particular window ignores that key or performs some action you find undesirable.
ja: これは、特定のウィンドウがそのキーを無視したり、好ましくない動作をする場合に有効です。

source: This is useful when the script allows the user to switch to and from the large-icon view.
ja: スクリプトでラージアイコン表示との切り替えが可能な場合に有効です。

source: This is useful when you want a hotstring to be kept unambiguous by still requiring an ending character, but don't actually want the ending character to be shown on the screen.
ja: これは、ホットストリングに終端文字を必要とすることで曖昧さをなくしたいけれども、実際には終端文字を画面に表示させたくない場合に有効です。

source: This is usually best because otherwise, the script would process messages out of chronological order whenever the monitor function interrupts itself.
ja: そうしないと、モニタ関数が割り込むたびに、スクリプトがメッセージを時系列に並べずに処理してしまうため、通常はこれが最適です。

source: This is usually either 1 or 2, but a for-loop can accept up to 19 variables.
ja: これは通常1か2のどちらかですが、forループは最大19個の変数を受け入れることができます。

source: This is usually harmless because any subsequent keystrokes sent to the same window get queued up behind the ones already in the buffer.
ja: これは、同じウィンドウに送信される後続のキー入力が、すでにバッファにあるキー入力の後ろにキューイングされるため、通常、無害です。

source: This is usually only necessary if the script uses the Send function to send the keys that comprise the hotkey itself, which might otherwise cause it to trigger itself.
ja: これは通常、スクリプトがSend関数を使用してホットキーそのものを構成するキーを送信する場合にのみ必要で、そうでない場合はそれ自体がトリガーされる可能性があります。

source: This is usually the name of a function, but is blank for exceptions thrown due to an error in an expression (such as using a math operator on a non-numeric value).
ja: これは通常、関数の名前ですが、式のエラー（数値以外の値で数学演算子を使用した場合など）によりスローされる例外の場合は空白になります。

source: This is usually the result from the OS's GetLastError() function after the script calls certain functions, including DllCall, Run/RunWait, File/Ini/Reg functions (where documented) and possibly others.
ja: これは通常、スクリプトがDllCall、Run/RunWait、File/Ini/Reg関数（文書化されている場合）、その他の特定の関数を呼び出した後にOSのGetLastError()関数から生じる結果です。

source: This is usually the same as the ProgramFiles environment variable.
ja: これは通常、ProgramFiles 環境変数と同じである。

source: This is usually unnecessary because of the default "smart" behaviour.
ja: デフォルトの「スマート」な振る舞いのため、これは通常不要である。

source: This is usually used to restore a hotkey's original function after having changed it, but can be used to assign the function of a different hotkey, provided that both hotkeys use the same HotIf criteria.
ja: 通常、ホットキーの機能を変更した後に元の機能に戻すために使用しますが、両方のホットキーが同じHotIf基準を使用している場合に、別のホットキーの機能を割り当てるために使用することもできます。

source: This is valid only when passing a variable to an optional parameter, array element or object literal; or on the right-hand side of a direct assignment.
ja: これは、変数をオプショナル・パラメーター、配列要素、オブジェクト・リテラルに渡す場合、または直接代入の右辺に渡す場合にのみ有効である。

source: This is why DTS_SHORTDATECENTURYFORMAT is the default and not DTS_SHORTDATEFORMAT.
ja: これが、DTS_SHORTDATECENTURYFORMATがデフォルトであり、DTS_SHORTDATEFORMATでない理由である。

source: This isn't the only way, but the most common.
ja: これが唯一の方法ではありませんが、最も一般的な方法です。

source: This kind of function might be used to avoid repetition, to make the code more manageable, or perhaps for other purposes.
ja: この種の機能は、繰り返しを避けるため、コードをより管理しやすくするため、あるいは他の目的で使用されるかもしれません。

source: This language bears some similarities to several other scripting languages, but also has its own unique strengths and pitfalls.
ja: この言語は、他のいくつかのスクリプト言語と類似していますが、独自の長所と落とし穴も持っています。

source: This limit applies both to FilePattern and any temporary pattern used during recursion into a subfolder.
ja: この制限は、FilePatternと、サブフォルダへの再帰中に使用される一時的なパターンの両方に適用されます。

source: This limit can be bypassed by using the \\?\ long path prefix, with some stipulations.
ja: この制限は、いくつかの条件を満たした上で、\\?\ ロングパスプリフィクスを使用することで回避することができます。

source: This limitation also applies to GetKeyState for Joy1 to Joy32 and JoyX, JoyY, JoyZ, JoyR, JoyU, JoyPOV (and possibly JoyV), but not for JoyName, JoyButtons, JoyAxes and JoyInfo.
ja: この制限は、Joy1～Joy32、JoyX、JoyY、JoyZ、JoyR、JoyU、JoyPOV（および場合によってはJoyV）のGetKeyStateにも適用されるが、JoyName、JoyButtons、JoyAxes、JoyInfoには適用されない。

source: This line does not contain a recognized action.
ja: この行には、認識された動作は含まれていません。

source: This line is indented with a tab; by default, that tab will also be written to the file.
ja: この行はタブでインデントされています。デフォルトでは、このタブもファイルに書き込まれます。

source: This line number will match the one shown by ListLines; it can be useful for error reporting such as this example:
ja: この行番号は、ListLinesが表示する行番号と一致する。この例のようなエラー報告に役立つ：

source: This line number will match the one shown by ListLines; it can be useful for error reporting such as this example: MsgBox "Could not write to log file (line number " A_LineNumber ")".
ja: この行番号は、ListLinesが表示する行番号と一致する。この例のようなエラー報告に役立つ：MsgBox "Could not write to log file (line number " A_LineNumber ")"。

source: This makes it more than 99.999% likely that at least one line after Critical "Off" will execute before an interruption.
ja: これにより、Critical "Off"以降の少なくとも1行が割り込み前に実行される可能性が99.999%以上となります。

source: This makes it more than 99.999 % likely that at least one line after Critical "Off" will execute before an interruption.
ja: これにより、Critical "Off"以降の少なくとも1行が割り込み前に実行される可能性が99.999 %以上となります。

source: This makes it possible for something like (Join: to start a continuation section.
ja: これにより、(Join:のようなものが継続部分を開始することが可能になります。

source: This makes it possible to include comments inside complicated patterns.
ja: これにより、複雑なパターンの中にコメントを入れることが可能になる。

source: This matches the previous behaviour of SendMessage/PostMessage, and replaces the ahk_parent special value previously used by ControlSend.
ja: これは、以前のSendMessage/PostMessageの動作と一致し、ControlSendで以前使用されていたahk_parent特殊値を置き換えます。

source: This may be changed in a future update.
ja: 今後のアップデートで変更される可能性があります。

source: This may be changed to implicitly call .ToString().
ja: これは、暗黙のうちに.ToString()を呼び出すように変更することができます。

source: This may be in a header file or type library.
ja: これは、ヘッダーファイルやタイプライブラリの中にあるかもしれません。

source: This may break scripts which used +Owner to set the parent window of a Gui after setting the styles.
ja: このため、スタイルを設定した後に +OwnerでGuiの親ウィンドウを設定していたスクリプトが壊れる可能性があります。

source: This may contain binary zero.
ja: バイナリーゼロを含む場合があります。

source: This may differ from the keyboard layout of the active window.
ja: アクティブウィンドウのキーボード配列と異なる場合があります。

source: This may lead to unexpected results.
ja: そのため、予期せぬ結果になる可能性があります。

source: This may not always work, according to at least one report.
ja: 少なくともある報告書によれば、これは必ずしもうまくいくとは限らない。

source: This means that CapsLock will not always be turned off for Send and ControlSend.
ja: つまり、Sendと ControlSendではCapsLockが常にOFFになるわけではありません。

source: This method also uses a "word sort", which treats hyphens and apostrophes in such a way that words like "coop" and "co-op" stay together.
ja: また、この方法では、「coop」と「co-op」のような単語が一緒になるようにハイフンやアポストロフィーを処理する「ワードソート」を使用しています。

source: This method can also be used to repeat an action while the user is holding down a key or button.
ja: この方法は、ユーザーがキーやボタンを押しながら動作を繰り返す場合にも使用できます。
